integration/inqueue/src_cf/DataProcessors/воКонсольЗаданийESB.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>воКонсольЗаданийESB</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

integration/inqueue/src_cf/InformationRegisters/воВходящиеСообщенияВОбработке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>воВходящиеСообщенияВОбработке</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КлючЗадания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Очередь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.воВходящиеВнутренниеОчереди</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

integration/inqueue/src_cf/Catalogs/воВходящиеВнутренниеОчереди.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>воВходящиеВнутренниеОчереди</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОчередьОтключена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЗарезервированныхПотоков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальноеКоличествоВыбираемыхСообщений</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОбрабатываемыеКлассы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Класс</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВнешниеСистемы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Система</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.воСистемыИнтеграционногоКонтура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

integration/inqueue/src_cf/DataProcessors/воКонсольЗаданийESB/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ПривилегированныйРежим() Тогда
		ВыполнитьПроверкуПравДоступа("Администрирование", Метаданные);
	КонецЕсли;
	
	ЗаполнитьФормуНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьФорму(Команда)
	
	ЗаполнитьФормуНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьФормуНаСервере()
	
	ТаблицаОбработчиков.Очистить();
	
	ЗапросКоличестваСообщений = Новый Запрос;
	ЗапросКоличестваСообщений.Текст = "ВЫБРАТЬ
	                                  |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ воВходящиеСообщенияВОбработке.ИдентификаторСообщения) КАК КоличествоВОбработке
	                                  |ИЗ
	                                  |	РегистрСведений.воВходящиеСообщенияВОбработке КАК воВходящиеСообщенияВОбработке
	                                  |ГДЕ
	                                  |	воВходящиеСообщенияВОбработке.КлючЗадания = &КлючЗадания";
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ИмяМетода", "воВходящиеОчередиВызовСервера.ОбработатьВходящиеСообщения");
	СтруктураОтбора.Вставить("Состояние", СостояниеФоновогоЗадания.Активно);
	
	Обработчики = ФоновыеЗадания.ПолучитьФоновыеЗадания(СтруктураОтбора);
	
	Для Каждого Обработчик Из Обработчики Цикл
		СтрокаКонсоли = ТаблицаОбработчиков.Добавить();
		Если СтрНачинаетсяС(Обработчик.Ключ, "ОбщийОбработчик") Тогда
			СтрокаКонсоли.ВидОбработчика = НСтр("ru = 'Общий обработчик'");
		ИначеЕсли СтрНачинаетсяС(Обработчик.Ключ, "ОбщийПриоритет") Тогда
			СтрокаКонсоли.ВидОбработчика = НСтр("ru = 'Общий приоритет'");
		ИначеЕсли СтрНачинаетсяС(Обработчик.Ключ, "ОбщийНагрузка") Тогда
			СтрокаКонсоли.ВидОбработчика = НСтр("ru = 'Общий нагрузка'");
		ИначеЕсли СтрНачинаетсяС(Обработчик.Ключ, "РезервныйОчередь") Тогда
			СтрокаКонсоли.ВидОбработчика = НСтр("ru = 'Резервный очередь'");
		Иначе	
			СтрокаКонсоли.ВидОбработчика = "";
		КонецЕсли;
		УИД = Новый УникальныйИдентификатор(Прав(Обработчик.Ключ, 36));
		Очередь = Справочники.воВходящиеВнутренниеОчереди.ПолучитьСсылку(УИД);
		Если Очередь = Справочники.воВходящиеВнутренниеОчереди.ПустаяСсылка() Тогда
			СтрокаКонсоли.Наименование = НСтр("ru = 'Общая очередь'");
			СтрокаКонсоли.Отключена = Ложь;
		Иначе
			СтрокаКонсоли.Наименование = Очередь.Наименование;
			СтрокаКонсоли.Отключена = Очередь.ОчередьОтключена;
		КонецЕсли;
		СтрокаКонсоли.Ссылка = Очередь;
		СтрокаКонсоли.НачалоВыполнения = Обработчик.Начало;
		СтрокаКонсоли.Выполняется = Истина;
		ЗапросКоличестваСообщений.УстановитьПараметр("КлючЗадания", Обработчик.Ключ);
		ВыборкаКоличества = ЗапросКоличестваСообщений.Выполнить().Выбрать();
		Если ВыборкаКоличества.Следующий() Тогда
			СтрокаКонсоли.КоличествоСообщенийВОбработке = ВыборкаКоличества.КоличествоВОбработке;
		Иначе
			СтрокаКонсоли.КоличествоСообщенийВОбработке = 0;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
